In [1]:
import pymysql
from sqlalchemy import create_engine
import pandas as pd
import getpass  # To get the password without showing the input

In [2]:
password = getpass.getpass()
connection_string = 'mysql+pymysql://root:' + password + '@localhost/bank'
engine = create_engine(connection_string)
%load_ext sql
%sql {connection_string}

 ······

'Connected: root@bank'

### Lesson 3 key concepts

> :clock10: 20 min

Working with views in SQL

- Use the `WITH CHECK OPTION` clause
- Drop an existing view


<summary> Description </summary>

Views also allow database administrators to restrict data retrieval. Through MySQL views, it is also possible to update data in the underlying table. MySQL views, when used with the `WITH CHECK OPTION` allow for a safeguard mechanism against the data inserted into the underlying table.
Some of the points to keep in mind before updating data in a view are:

- The view should not have any aggregate clauses or function like `SUM`, `COUNT`, etc.
- The view should not have any right or left outer joins.
- The view should not have `UNION`, `GROUP BY`, `HAVING`, `DISTINCT` clauses.

The `WITH CHECK OPTION` prevents a view from updating or inserting rows that are not visible through it. In other words, whenever you update or insert a row of the base tables through a view, MySQL ensures that the insert or update operation is conformed with the definition of the view.


<summary> Code Sample: `WITH CHECK OPTION` </summary>

In [22]:
%%sql
drop view if exists customer_status_D;

create view customer_status_D as
select * from bank.loan
where status = 'D'
with check option;

 * mysql+pymysql://root:***@localhost/bank
0 rows affected.
0 rows affected.

[]

Or you can also use :

In [23]:
%%sql
create or replace view customer_status_D as
select * from bank.loan
where status = 'D'
with check option;

 * mysql+pymysql://root:***@localhost/bank
0 rows affected.

[]

Now if we try to insert new values in the table through the view, it doesn't work as the check is not met for status `D`:

In [24]:
%%sql
select * from customer_status_D
limit 2;

 * mysql+pymysql://root:***@localhost/bank
2 rows affected.

[(5060, 426, 940719, 252060, 60, 4201.0, 'D'),
 (7142, 10451, 941219, 482940, 60, 8049.0, 'D')]

In [26]:
%%sql
insert into customer_status_D values (0000, 00000, 987398, 00000, 60, 00000, 'C');

 * mysql+pymysql://root:***@localhost/bank
(pymysql.err.OperationalError) (1369, "CHECK OPTION failed 'bank.customer_status_d'")
[SQL: insert into customer_status_D values (0000, 00000, 987398, 00000, 60, 00000, 'C');]
(Background on this error at: http://sqlalche.me/e/13/e3q8)

But, in this case we have removed the `WITH CHECK OPTION` and now, if we try to insert new values in the table through the view, it works even if the status `D` condition is not met:

In [27]:
%%sql
create or replace view customer_status_D as
select * from bank.loan
where status = 'D';

 * mysql+pymysql://root:***@localhost/bank
0 rows affected.

[]

In [28]:
%%sql
select * from customer_status_D
limit 2;

 * mysql+pymysql://root:***@localhost/bank
2 rows affected.

[(5060, 426, 940719, 252060, 60, 4201.0, 'D'),
 (7142, 10451, 941219, 482940, 60, 8049.0, 'D')]

In [29]:
%%sql
insert into customer_status_D values (0000, 00000, 987398, 00000, 60, 00000, 'C');

 * mysql+pymysql://root:***@localhost/bank
1 rows affected.

[]

In [31]:
%%sql
select * from  bank.loan
order by loan_id
limit 3;

 * mysql+pymysql://root:***@localhost/bank
3 rows affected.

[(0, 0, 987398, 0, 60, 0.0, 'C'),
 (0, 0, 987398, 0, 60, 0.0, 'C'),
 (0, 0, 987398, 0, 60, 0.0, 'C')]

<summary> Code Sample: DROP EXISTING VIEW </summary>

In [32]:
%%sql
drop view if exists customer_status_D;

 * mysql+pymysql://root:***@localhost/bank
0 rows affected.

[]

# 3.06 Activity 3

The table `client` has a field `birth_number` that encapsulates client birthday and sex. The number is in the form `YYMMDD` for men, and in the form `YYMM+50DD` for women, where `YYMMDD` is the date of birth. Create a view `client_demographics` with `client_id`, `birth_date` and `sex` fields. Use that view and a CTE to find the number of loans by status and sex.

In [12]:
%%sql
select client_id,birth_number
from bank.client
limit 2;

 * mysql+pymysql://root:***@localhost/bank
2 rows affected.

[(1, 706213), (2, 450204)]

In [43]:
(965714 % 10000 - 965714 % 100) / 100

57.0

14

In [44]:
%%sql
create or replace view client_demographics as
select client_id, birth_number,
               convert(
                concat('19', substr(convert(birth_number, char(6)),1,2),'-', 
                case when convert(substr(convert(birth_number, char(6)),3,2), unsigned) > 50
                then substr(concat('0',convert(convert(substr(convert(birth_number, char(6)),3,2), unsigned) - 50, char(2))), -2)
                else substr(convert(birth_number, char(6)),3,2)
                end, 
                '-', substr(convert(birth_number, char(6)),5,2)), date
               ) as birth_date,
               
               case when ((birth_number % 10000) - (birth_number % 100)) / 100 > 50
               then 'f'
               else 'm' end as sex
from bank.client;

 * mysql+pymysql://root:***@localhost/bank
0 rows affected.

[]

In [47]:
%%sql
select * from client_demographics
limit 2;

 * mysql+pymysql://root:***@localhost/bank
2 rows affected.

[(1, 706213, datetime.date(1970, 12, 13), 'f'),
 (2, 450204, datetime.date(1945, 2, 4), 'm')]

In [50]:
%%sql
select distinct client_id, account_id from bank.disp
limit 5

 * mysql+pymysql://root:***@localhost/bank
5 rows affected.

[(1, 1), (2, 2), (3, 2), (4, 3), (5, 3)]

In [62]:
%%sql
with bank_accounts as (
  select distinct client_id, account_id from bank.disp
), 
loan_info as (
  select c.client_id, c.sex, l.status
  from bank_accounts a
  inner join bank.client_demographics c on c.client_id = a.client_id
  inner join bank.loan l on a.account_id = l.account_id
)
select * from loan_info
limit 2;

 * mysql+pymysql://root:***@localhost/bank
2 rows affected.

[(2, 'm', 'A'), (3, 'f', 'A')]

In [57]:
%%sql
with bank_accounts as (
  select distinct client_id, account_id from bank.disp
), 
loan_info as (
  select c.client_id, c.sex, l.status
  from bank_accounts a
  inner join bank.client_demographics c on c.client_id = a.client_id
  inner join bank.loan l on a.account_id = l.account_id
)
select status, sum(case when sex = 'M' then 1 end) as M , sum(case when sex = 'F' then 1 end) as F
from loan_info
group by status;

 * mysql+pymysql://root:***@localhost/bank
4 rows affected.

[('A', Decimal('128'), Decimal('130')),
 ('B', Decimal('14'), Decimal('17')),
 ('D', Decimal('21'), Decimal('24')),
 ('C', Decimal('247'), Decimal('246'))]